{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two completed Hero component changes: replacing the background image with a houseboat asset and removing the three stats items, both with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing each component, data file, and configuration file's purpose and key contents.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, accent, and sidebar variables.",
  "frontend/index.html": "HTML entry point with SEO meta tags targeting Kerala tour keywords, Poppins Google Font imports, and a root div mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that composes all page sections in order: Header, Hero, DestinationHighlights, Packages, WhyChooseSTC, Testimonials, CTABanner, Footer, MobileBottomNav, and FloatingWhatsAppButton.",
  "frontend/src/components/CTABanner.tsx": "Full-width CTA section with a green background, decorative circles, 'Ready to Explore Kerala?' heading, and WhatsApp and Call Now action buttons.",
  "frontend/src/components/DestinationHighlights.tsx": "Horizontally scrollable circular destination card row that opens a full-screen modal with details when a destination is clicked.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Fixed floating WhatsApp button with a pulse animation and hover tooltip that links to a pre-filled WhatsApp chat.",
  "frontend/src/components/Footer.tsx": "Dark green footer with brand info, quick links, package links, contact details, social icons, and a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Fixed top navigation bar with logo, smooth-scroll nav links, call and WhatsApp CTA buttons, scroll-aware shadow, and a hamburger menu for mobile.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background houseboat image, headline, and two CTA buttons for viewing packages and opening WhatsApp, plus a scroll-down indicator.",
  "frontend/src/components/MobileBottomNav.tsx": "Fixed bottom navigation bar visible only on mobile with four tabs: Home, Packages, WhatsApp, and Call.",
  "frontend/src/components/PackageCard.tsx": "Card component for a single tour package displaying image, badge, duration, highlights, inclusions, price, and a WhatsApp enquiry button with an expandable details toggle.",
  "frontend/src/components/Packages.tsx": "Section that renders a responsive grid of PackageCard components sourced from the packages data file, with a section header.",
  "frontend/src/components/Testimonials.tsx": "Section displaying a grid of traveler review cards with star ratings, quote text, and author info sourced from the testimonials data file.",
  "frontend/src/components/WhyChooseSTC.tsx": "Section showcasing five key selling points (private cab, premium stays, local expertise, 24/7 support, customized trips) as icon cards with a hover color-flip effect.",
  "frontend/src/data/destinations.ts": "Defines the Destination interface and exports an array of 7 Kerala travel destinations, each with id, name, emoji, image path, description, highlights, and optional notes.",
  "frontend/src/data/packages.ts": "Defines Package and ItineraryDay interfaces, exports a shared inclusions list, and provides an array of Kerala tour packages with pricing, routes, and day-by-day itineraries.",
  "frontend/src/data/testimonials.ts": "Defines the Testimonial interface and exports three customer review entries with name, location, rating, review text, avatar initials, and associated package name.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider component and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS layers, defines STC brand color tokens as OKLCH CSS variables, maps them to shadcn UI tokens, and adds custom utility classes for shadows and brand colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the default theme with STC brand colors in OKLCH, Poppins font, custom border radii, box shadows, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state (version 9) for STC – South Indian Tour Crafters travel website, documenting architecture, color/font tokens, existing features, known issues, and image requirements for a single-file HTML/CSS/JS Kerala tourism site."
}